-- 1. EMP_TEST01 테이블을 생성(EMPLOYEE 테이블 구조만 복사)하고
-- EMPLOYEE 테이블에서 급여가 2500000 이상인 사원의
-- 사번, 이름, 직급코드, 부서코드, 급여, 입사일 조회하여 EMP_TEST01 테이블에 삽입


-- 2. EMP_TEST01 에서 '유재식' 사원과 직급코드가 같은 사원의 급여를
-- '유재식' 사원과 동일하게 변경


-- 3. EMP_TEST01 에서 부서명이 '인사관리부'인 직원의
-- 월급을 모두 350만원으로 인상


-- 4. M_TB01테이블을 생성하고 안에 ID, NAME을 만들고
-- M_TB02 테이블 안에 ID, NAME을 만들어서
-- 각각 데이터를 3개 정도 삽입 후 MERGE 하시오


-- 5. 영화 에피소드 저장
-- 테이블 명: MOVIE_SPIDERMAN
-- 컬럼 : EPISODE_ID--기본키(SPIDERMAN_PK), EPISODE_NAME, OPEN_YEAR
-- 스파이더맨 시리즈를 순서대로 삽입


-- 6. EMP_SALARY 테이블을 생성하고
-- 유럽 근무지역에 근무하는 직원의 부서를 D3으로 변경. (서브쿼리를 이용한 UPDATE문)


-- 7. EMP_SALARY 테이블에서 송은희, 하이유 사원의 급여를
-- 선동일 사원과 동일하게 변경. (UPDATE 문)


-- 8. TEST_DEPARTMENT 테이블을 생성하고 (DEPARTMENT 테이블 가져옴)
-- 중국에서 일하던 사원들이 미국으로 인사발령을 받았다.
-- 이를 반영하는 UPDATE문을 작성하시오.


-- 9. EMPLOYEE 테이블에서 직급이 사원이면서 유럽에 근무하는 직원의
-- 사번, 이름, 직급명, 근무지명, 부서명을 조회하시오.


-- 10.. EMPLOYEE 테이블에서 급여가 3,000,000원 이상인 직원의
-- 사번, 이름, 급여를 조회하여
-- HIGH_SAL 테이블에 삽입하고
-- 그 미만으로 받는 직원들은 LOW_SAL 테이블에 삽입하시오.

